using System;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using static System.Net.Mime.MediaTypeNames;

namespace RandomSymbol
{
	internal class Program
	{
		static void Main(string[] args)
		{
			//string path = "note1.txt";
			//using(StreamReader reader = new StreamReader(path))
			//{
			//	Console.WriteLine(reader.ReadToEnd());
			//};
			char[] Alphabet =
				{
				'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я'
				};
			int[] numbers = new int[100];
			//string[] words = { "абажур", "абзац", "абонент", "абрикос", "авария", "август", "автомобиль", "агент", "агроном", "адвокат", "адрес", "азбука", "айсберг", "академия", "аквариум", "аккорд", "акробат", "аксессуар", "акула", "алгебра", "аллея", "альбом", "альпинист", "амазонка", "амбар", "амеба", "амнезия", "амнистия", "амулет", "ангел", "анекдот", "анимация", "анкета", "антибиотик", "апельсин", "аплодисменты", "аппарат", "апрель", "аптека", "арбат", "арбуз", "аренда", "аромат", "архитектор", "асимметрия", "аспирин", "астроном", "атлас", "атлет", "атмосфера", "аудитория", "аукцион", "афиша", "африка", "афродита", "ахиллес", "бабочка", "багаж", "баклажан", "балет", "балкон", "баллада", "бамбук", "банан", "банка", "банкрот", "барабан", "барак", "баржа", "барометр", "барсук", "баскетбол", "бассейн", "батарея", "батон", "башня", "баян", "бегемот", "бедро", "безумие", "белка", "бензин", "береза", "библиотека", "бизон", "билет", "бинокль", "биография", "биржа", "битва", "бицепс", "благо", "бледный", "блин", "блокнот", "блондинка", "блюз", "богатство", "бодрость", "бокал", "болезнь", "болото", "больница", "борода", "борщ", "ботаник", "ботинок", "бочка", "боязнь", "браслет", "брат", "бревно", "бревенчатый", "бриллиант", "бритва", "брокер", "бросок", "брюки", "бублик", "будильник", "буйвол", "буква", "букет", "булава", "бумага", "буран", "буря", "бусы", "бутылка", "бухта", "бык", "быстрота", "бюджет", "вагон", "важность", "ваза", "вакуум", "вакцина", "валюта", "ванная", "варенье", "вариант", "василиск", "вата", "вахта", "вдохновение", "ведро", "ведьма", "вездеход", "велосипед", "веник", "вентилятор", "верблюд", "веревка", "верность", "вертолет", "веселье", "весна", "вестибюль", "ветер", "ветеринар", "ветка", "вечер", "вешалка", "вещь", "взлет", "взрыв", "видение", "визит", "вилка", "вино", "виртуоз", "вирус", "виски", "витамин", "вихрь", "вишня", "вклад", "вода", "водопад", "военачальник", "вождь", "воздушный", "вокзал", "волейбол", "волк", "волна", "волосы", "волшебник", "вопрос", "ворота", "воротник", "ворчание", "восторг", "восток", "вояж", "врач", "время", "всадник", "вспышка", "встреча", "вторник", "вулкан", "высота", "высокий", "выпускник", "выражение", "выставка", "вышивка", "газета", "газон", "галерея", "галифе", "галстук", "гамак", "гамма", "гараж", "гардина", "гармония", "гарпун", "гвардия", "гвоздь", "геморрой", "гениальность", "генерал", "генетика", "географ", "геология", "герб", "геркулес", "герой", "гид", "гипотеза", "гитара", "глава", "гладильная", "глаз", "глотка", "глубина", "глупость", "гнев", "гнездо", "гном", "гобелен", "голова", "голос", "гольф", "гондола", "гора", "гордость", "горизонт", "горилл", "горшок", "госпиталь", "гость", "град", "грамматика", "граммофон", "гранат", "гранит", "график", "грезы", "грелка", "гриб", "гром", "грузовик", "груша", "гусеница", "гусь", "дама", "дамба", "дар", "дата", "движение", "двойник", "дворец", "дебаты", "девушка", "дедушка", "декабрь", "дело", "демократия", "день", "депутат", "дерево", "десерт", "десятка", "детектив", "дефис", "дефолт", "деятель", "джемпер", "джип", "джунгли", "диван", "диета", "дизайн", "дизель", "диковина", "дилемма", "диммер", "динозавр", "дирижабль", "диск", "дисплей", "дитя", "дичь", "дневник", "дно", "доктор", "долг", "долина", "дом", "домино", "допинг", "дорога", "досуг", "дотация", "дощечка", "доярка", "дракон", "драма", "дружба", "дружинник", "дуб", "дубликат", "дудка", "дума", "дупло", "дуэт", "душа", "дым", "дыня", "дыра", "дыхание", "дядя", "егерь", "ежевика", "ежик", "езда", "елка", "емкость", "ерунда", "есаул", "жаба", "жадность", "жалоба", "жара", "жареный", "жасмин", "жатва", "жгут", "желание", "желудок", "жемчуг", "жест", "живопись", "жизнь", "жир", "жнец", "жокей", "жук", "журналист", "жюри", "забор", "завод", "загадка", "заговор", "задание", "задор", "зажигалка", "зазор", "зайчик", "закон", "зал", "замок", "замша", "занавес", "запах", "записка", "запрет", "заря", "засада", "заслон", "засуха", "затвор", "защита", "звезда", "звон", "здание", "здоровье", "зебра", "зелень", "земля", "зерно", "зима", "злато", "злодей", "змея", "знаменитость", "знак", "знание", "знаток", "золото", "зоопарк", "зрение", "зуб", "игла", "игра", "игрушка", "идеал", "идея", "идол", "изба", "известие", "издатель", "изумруд", "изучение", "икона", "имбирь", "иметь", "имидж", "иммунитет", "император", "импульс", "инвалид", "инвестиция", "инвентарь", "инженер" };
			string[] words = { "Негр", "Боров", "Потап" };
			for(int i = 0; i < numbers.Length; i++)
			{
				numbers[i] = i;
			}
			bool isWorking = true;
			
			var RandomSymbolObj = new RandomClass();
			
			Console.WriteLine("Данная программа выводит случайный символ русского алфавита по нажатии любой кнопки!");
			Console.ReadKey();
			//Вызвать случайный символ

			//Меню выбора режима
			Console.WriteLine("Выберите 1 для режима случайных символов");
			Console.WriteLine("Выберите 2 режим создание случайного словосочетания");
			while (isWorking)
			{
				ConsoleKeyInfo userInput = Console.ReadKey();
				//RandomSymbolObj.RandomColor();
				//RandomSymbolObj.RandomSymbol(Alphabet, userInput);
				//RandomSymbolObj.RandomNumber(numbers);
				//RandomSymbolObj.RandomWordWithDeleting(words);
				//
				


			}
			
			
		}
		
	}
}
